Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_IoT01L475VG.c
      if(AzureConnection.ConnectionString[0]!=0) {
        AZURE_PRINTF("\tSaved Connection String :\r\n");
        AZURE_PRINTF("\t\t%s\r\n",AzureConnection.ConnectionString);
#ifdef AZUREDEVICECONNECTIONSTRING
      } else {
        sprintf(AzureConnection.ConnectionString,"%s", (char *) AZUREDEVICECONNECTIONSTRING);
        AZURE_PRINTF("\tDefault Connection String  : %s\r\n", AzureConnection.ConnectionString);
#endif /* AZUREDEVICECONNECTIONSTRING */
      }

      if(AzureConnection.ConnectionString[0]!=0) {
        AZURE_PRINTF("Wait 3 seconds for allowing User Button Control for changing it\r\n");
        {
          int32_t CountOn,CountOff;
          for(CountOn=0;CountOn<3;CountOn++) {
            BSP_LED_On(LED2);
            for(CountOff=0;CountOff<10;CountOff++) {
              if(CountOff==2) {
                BSP_LED_Off(LED2);
              }
              /* Handle user button */
              if(ButtonPressed) {
                CounterButtonPress++;
                ButtonPressed=0;
                goto INSERT_LABEL2;
              }
              HAL_Delay(100);
            }
          }
        }
INSERT_LABEL2:
        if(CounterButtonPress) {
          AZURE_PRINTF("\tDo you want to change it?(y/n)\r\n");
          scanf("%s",console_input);
          if(console_input[0]!='y') {
            /* If we don't want to change it */
            ReadFromTerminal=0;
          } else {
            /* If the NFC is present */
            if(TargetBoardFeatures.NFCInitialized) {
              AZURE_PRINTF("\tDo you want to read them from NFC?(y/n)\r\n");
              scanf("%s",console_input);
              if(console_input[0]=='y') {
                NDEF_Text_info_t TextInfo;
                if(TT4_ReadTextToken(&TextInfo) == SUCCESS) {
                  ReadFromTerminal=0;
                  sprintf(AzureConnection.ConnectionString,"%s",TextInfo.text);
                  NecessityToSaveMMD=1;
                  MDM_SaveGMD(GMD_AZURE,(void *)&AzureConnection);
                  AZURE_PRINTF("connectionString from NFC=\r\n\t%s\r\n",connectionString);
                } else {
                  AZURE_PRINTF("Err reading the Connection String from NFC\r\n");
                  AZURE_PRINTF("Add them manually\r\n");
                }
              }
            }
          }
        } else {
          ReadFromTerminal=0;
        }
      } else {
        AZURE_PRINTF("Azure Connection String not present\r\n");
        /* If the NFC is present */
        if(TargetBoardFeatures.NFCInitialized) {
          AZURE_PRINTF("\tDo you want to read them from NFC?(y/n)\r\n");
          scanf("%s",console_input);
          if(console_input[0]=='y') {
            NDEF_Text_info_t TextInfo;
            if(TT4_ReadTextToken(&TextInfo) == SUCCESS) {
              ReadFromTerminal=0;
              sprintf(AzureConnection.ConnectionString,"%s",TextInfo.text);
              NecessityToSaveMMD=1;
              MDM_SaveGMD(GMD_AZURE,(void *)&AzureConnection);
              AZURE_PRINTF("connectionString from NFC=\r\n\t%s\r\n",connectionString);
            } else {
              AZURE_PRINTF("Err reading the Connection String from NFC\r\n");
              AZURE_PRINTF("Add them manually\r\n");
            }
          }
        }
      }

      /* if we need to read the connection String from UART */
      if(ReadFromTerminal) {
        AZURE_PRINTF("Enter the Azure Connection String:\r\n");
        scanf("%s",AzureConnection.ConnectionString);
        NecessityToSaveMMD=1;
        MDM_SaveGMD(GMD_AZURE,(void *)&AzureConnection);
        AZURE_PRINTF("\r\n");
      }
    }

#endif /* AZURE_ENABLE_REGISTRATION */
    
    /* Save the MetaDataManager in Flash if it's necessary */
    if(NecessityToSaveMMD) {
      EraseMetaDataManager();
      SaveMetaDataManager();
    }
  }

  /* Initialize the WIFI module */
  if (net_init(&hnet, NET_IF_WLAN, (net_if_init)) != NET_OK) {
    AzureExit(AZURE_ERR_WIFI);
  }
  
  /* initialize Real Time Clock */
  InitRTC();
  /* Check if Data stored in BackUp register0: No Need to reconfigure RTC */
  while(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2){
    /* Configure RTC Calendar */
    char hostname[16]; // "time-d.nist.gov";
    uint8_t tcpPort  =  NTP_ENDPOINT_TCPPORT;
    net_sockhnd_t socket;
    uint8_t NumRentryNTP=0;
    static NTP_ENDPOINT NTP_Server=NTP_DEFAULT;
    switch(NTP_Server) {
      case NTP_DEFAULT:
        strcpy(hostname, NTP_ENDPOINT_IPADDRESS_DEFAULT);
      break;
      case NTP_BACKUP1:
        strcpy(hostname, NTP_ENDPOINT_IPADDRESS_BACKUP1);
      break;
      case NTP_BACKUP2:
        strcpy(hostname, NTP_ENDPOINT_IPADDRESS_BACKUP2);
      break;
      default:
        AzureExit(AZURE_ERR_NTP);
    }

    AZURE_PRINTF("Contact NTP server %s \r\n", hostname);

    if(net_sock_create(hnet, &socket, NET_PROTO_TCP)!=NET_OK) {
      AZURE_PRINTF("Err creating socket for NTP server\r\n");
    } else {
      AZURE_PRINTF("WiFi created socket for NTP server\r\n");
      if(net_sock_open(socket, hostname, tcpPort)!= NET_OK) {
        AZURE_PRINTF("Err opening socket with NTP server\r\n");
      } else {
        uint8_t buf[4];
        AZURE_PRINTF("WiFi opened socket with NTP server\r\n");
        if(net_sock_recv(socket, buf, 4)!=4) {
          AZURE_PRINTF("Err Failed to retrieve data from NTP server \r\n");
        } else {
          time_t epochTimeToSetForSystem = SynchronizationAgentConvertNTPTime2EpochTime(buf,4);
          if (TimingSystemSetSystemTime(epochTimeToSetForSystem)== 0){
            AZURE_PRINTF("Err Failed to set system time. \r\n");
          } else {
            AZURE_PRINTF("Set UTC Time: %s\r\n",(get_ctime(&epochTimeToSetForSystem)));
          }
        }
      }
    }

    if(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2) {
      // NTP server cannot be queried more frequently than once every 4 seconds
      AZURE_PRINTF("I'll try again to connect to NTP server in 4 seconds\r\n");
      HAL_Delay(4000);
      NumRentryNTP++;
      if (NumRentryNTP == NTP_MAX_RETRIES){
        NumRentryNTP = 0;

