Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_IoT01L475VG.c
        switch(NTP_Server) {
          case NTP_DEFAULT:
            AZURE_PRINTF("NTP backup 1\r\n");
            NTP_Server = NTP_BACKUP1;
          break;
          case NTP_BACKUP1:
            AZURE_PRINTF("NTP backup 2\r\n");
            NTP_Server = NTP_BACKUP2;
          break;
          case NTP_BACKUP2:
            AZURE_PRINTF("NTP Default\r\n");
            NTP_Server = NTP_DEFAULT;
          break;
          default:
            AzureExit(AZURE_ERR_NTP);
        }
      }
    }
    if(net_sock_close(socket)!=NET_OK) {
      AZURE_PRINTF("Err closing the socket with NTP server\r\n");
    } else {
      AZURE_PRINTF("WIFI closed socket with NTP server\r\n");
    }
    if(net_sock_destroy(socket)!=NET_OK) {
      AZURE_PRINTF("Err destroying the socket for NTP server\r\n");
    } else {
      AZURE_PRINTF("WIFI destroied socket for NTP server\r\n");
    }
  }
  /* RTC Is ok */
  {
    uint8_t aShowTime[50] = {0};
    uint8_t aShowDate[50] = {0};
    RTC_CalendarShow(aShowTime,aShowDate);
    AZURE_PRINTF("Real Time Clock Intialized: %s %s\r\n",aShowDate,aShowTime);
  }
  return 0;
}

/**
  * @brief  Function for initializing the WIFI module
  * @param  void *if_ctxt pointer to the context
  * @retval None
  */
static int net_if_init(void * if_ctxt)
{
  char moduleinfo[ES_WIFI_MAX_SSID_NAME_SIZE];
  WIFI_Ecn_t security_mode = (WIFI_CredAcc.mode == None) ? WIFI_ECN_OPEN : ((WIFI_CredAcc.mode == WEP) ? WIFI_ECN_WEP : WIFI_ECN_WPA2_PSK);
  int32_t wifiConnectCounter=1;

  if(WIFI_Init()!=WIFI_STATUS_OK) {
    AZURE_PRINTF("Failed to initialize WIFI module\r\n");
    AzureExit(AZURE_ERR_WIFI);
  } else {
    AZURE_PRINTF("WIFI module initialized\r\n");
  }

  /* Retrieve the WiFi module mac address to confirm that it is detected and communicating. */
  WIFI_GetModuleName(moduleinfo);
  AZURE_PRINTF("Module initialized successfully: %s\r\n",moduleinfo);

  WIFI_GetModuleID(moduleinfo);
  AZURE_PRINTF("\t%s\r\n",moduleinfo);

  WIFI_GetModuleFwRevision(moduleinfo);
  AZURE_PRINTF("\t%s\r\n",moduleinfo);

  if(WIFI_GetMAC_Address( (uint8_t*)macAddress)!=WIFI_STATUS_OK) {
    AZURE_PRINTF("Failed to get MAC address\r\n");
    AzureExit(AZURE_ERR_WIFI);
  } else {
    AZURE_PRINTF("WiFi MAC Address is: %02x:%02x:%02x:%02x:%02x:%02x\r\n",
         macAddress[0], macAddress[1], macAddress[2],
         macAddress[3], macAddress[4], macAddress[5]);
  }

  /* Connect to the specified SSID. */
  AZURE_PRINTF("Trying to Connect WIFI to AP\r\n");
  while(WIFI_Connect(WIFI_CredAcc.ssid, WIFI_CredAcc.seckey, security_mode) != WIFI_STATUS_OK) {
    AZURE_PRINTF("WiFi not able Connected to AP Attempt = %ld\r\n",wifiConnectCounter++);
    HAL_Delay(1000);
    /* Max number of attempts */
    if(wifiConnectCounter == WIFI_CONNECT_MAX_ATTEMPT_COUNT) {
	  AZURE_PRINTF("WiFi not able to connected to AP %s\r\n",WIFI_CredAcc.ssid);
	  AzureExit(AZURE_ERR_WIFI);
    }
  }
  AZURE_PRINTF("WiFi Connected to AP %s\r\n",WIFI_CredAcc.ssid);

  /* Until is ok */
  return 0;
}

/**
  * @brief  Function for signaling Error
  * @param  AZURE1_ERROR Value Error Type
  * @retval None
  */
void AzureExit(AZURE1_ERROR Value)
{
  AZURE_PRINTF("\r\nErr Type %s\r\n",ENUM_TO_STRING(AZURE1_ERROR,Value));
  AZURE_PRINTF("\tNecessity to restart the Board\r\n");
  /* Infinite led blinking */
  BSP_LED_Off(LED2);
  while(1) {
    int32_t Counter;
    /* Blinking Error Code... */
    for(Counter=0;Counter<Value;Counter++) {
      BSP_LED_On(LED2);
      HAL_Delay(200);
      BSP_LED_Off(LED2);
      HAL_Delay(400);
    }
    HAL_Delay(4000);
  }
}

/**
  * @brief  Function for starting the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StartTimer1(void) {
  /* Starting timer */
  if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }

  /* Set the new Capture compare value */
  {
    uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
    /* Set the Capture Compare Register value */
    __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + TargetBoardFeatures.TIM_CC1_Pulse));
  }

  AZURE_PRINTF("Channel 1 for Timer 1 started\r\n");
}

/**
  * @brief  Function for pausing the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StopTimer1(void) {
  /* Stop timer */
  if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }
  AZURE_PRINTF("Channel 1 for Timer 1 stopped\r\n");
}


/** @brief function for providing the default TLS I/O interface
 * @param None
 * @retval IO_INTERFACE_DESCRIPTION* Pointer to the default TLS I/O interface
 */
const IO_INTERFACE_DESCRIPTION* platform_get_default_tlsio(void)
{
  return tlsio_mbedtls_STM32Cube_get_interface_description();
}

/** @brief Function for de-initializing the platform
 * @param None
 * @retval None
 */
void platform_deinit(void)
{
  /* TODO: Insert here any platform specific one time de-initialization code like.
  This has to undo what has been done in platform_init. */
}


/** @brief Initialize all the MEMS1 sensors
 * @param None
 * @retval None
 */
static void Init_MEM1_Sensors(void)
{
  /* Accelero */
  if (ACCELERO_OK != BSP_ACCELERO_Init()) {
   AZURE_PRINTF("Err Accelero Sensor\n\r");
  } else {
    AZURE_PRINTF("Ok Accelero Sensor\n\r");
  }

  /* Gyro */
  if (GYRO_OK != BSP_GYRO_Init()) {
   AZURE_PRINTF("Err Gyroscope Sensor\n\r");
  } else {
    AZURE_PRINTF("Ok Gyroscope Sensor\n\r");
  }

  /* Mag */
  if (MAGNETO_OK != BSP_MAGNETO_Init()) {
   AZURE_PRINTF("Err Magneto Sensor\n\r");
  } else {
    AZURE_PRINTF("Ok Magneto Sensor\n\r");
  } 

  /* Humidity */
  if (HSENSOR_OK != BSP_HSENSOR_Init()) {
   AZURE_PRINTF("Err Humidity Sensor\n\r");
  } else {
    AZURE_PRINTF("Ok Humidity Sensor\n\r");
  }

  /* Temperature */
  if (TSENSOR_OK != BSP_TSENSOR_Init()) {
   AZURE_PRINTF("Err Temperature Sensor\n\r");
  } else {
    AZURE_PRINTF("Ok Temperature Sensor\n\r");
  }

